In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
data = pd.read_excel('C:/Users/Administrator/Downloads/UASmain/dataset_soal2.xls')

In [4]:
data

  Category  Weather V-1  Holiday V-2  Game V-3  Qty
0        A            5            1         0  250
1        B            3            1         1  200
2        C            1            1         0   75
3        D            4            1         1  400
4        E            4            0         0  150
5        F            2            0         0   50

In [6]:
import math 
dis = []
for i in range(6):
    dis.append(math.sqrt((float(data.iloc[i]['Weather V-1'])-1)**2
                         +(float(data.iloc[i]['Holiday V-2'])- 0)**2
                         +(float(data.iloc[i]['Game V-3'])-0)**2))
data['dis'] = dis
data

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  4.123106
1        B            3            1         1  200  2.449490
2        C            1            1         0   75  1.000000
3        D            4            1         1  400  3.316625
4        E            4            0         0  150  3.000000
5        F            2            0         0   50  1.000000

In [7]:
data.sort_values('dis')

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
2        C            1            1         0   75  1.000000
5        F            2            0         0   50  1.000000
1        B            3            1         1  200  2.449490
4        E            4            0         0  150  3.000000
3        D            4            1         1  400  3.316625
0        A            5            1         0  250  4.123106

In [8]:
data.sort_values('dis').head(4)

  Category  Weather V-1  Holiday V-2  Game V-3  Qty      dis
2        C            1            1         0   75  1.00000
5        F            2            0         0   50  1.00000
1        B            3            1         1  200  2.44949
4        E            4            0         0  150  3.00000

In [9]:
y = data.sort_values('dis').head(4)

In [10]:
z = y["Qty"]
z

2     75
5     50
1    200
4    150
Name: Qty, dtype: int64

In [11]:
np.mean(z)

118.75

In [13]:
import math 
dis = []
for i in range(6):
    dis.append(math.sqrt((float(data.iloc[i]['Weather V-1'])-4)**2
                         +(float(data.iloc[i]['Holiday V-2'])- 1)**2
                         +(float(data.iloc[i]['Game V-3'])-1)**2))
data['dis'] = dis
data

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  1.414214
1        B            3            1         1  200  1.000000
2        C            1            1         0   75  3.162278
3        D            4            1         1  400  0.000000
4        E            4            0         0  150  1.414214
5        F            2            0         0   50  2.449490

In [14]:
data.sort_values('dis').head(4)

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
3        D            4            1         1  400  0.000000
1        B            3            1         1  200  1.000000
0        A            5            1         0  250  1.414214
4        E            4            0         0  150  1.414214

In [15]:
y = data.sort_values('dis').head(4)

In [16]:
z = y["Qty"]
z

3    400
1    200
0    250
4    150
Name: Qty, dtype: int64

In [17]:
np.mean(z)

250.0